[
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [19.82, 41.33] },
    "properties": {
      "capital": "Tirana",
      "country": "Albania",
      "continent": "europe"
    },
    "history":
      "Albania declared its independence from the Ottoman Empire in 1912, but was conquered by Italy in 1939. Communist partisans took over the country in 1944. Albania allied itself first with the USSR (until 1960), and then with China (to 1978). In the early 1990s, Albania ended 46 years of xenophobic Communist rule and established a multiparty democracy. The transition has proven challenging as successive governments have tried to deal with high unemployment, widespread corruption, dilapidated infrastructure, powerful organized crime networks, and combative political opponents. Albania has made progress in its democratic development since first holding multiparty elections in 1991, but deficiencies remain. International observers judged elections to be largely free and fair since the restoration of political stability following the collapse of pyramid schemes in 1997; however, each of Albania's post-Communist elections have been marred by claims of electoral fraud. The 2009 general elections resulted in a coalition government, the first such in the country''s history. Albania joined NATO in April 2009 and is a potential candidate for EU accession. Although Albania''s economy continues to grow, the country is still one of the poorest in Europe, hampered by a large informal economy and an inadequate energy and transportation infrastructure.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/1505073.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/14058421.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/82183.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/14058598.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/14053097.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/966781.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/14053234.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/14058257.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [1.52, 42.51] },
    "properties": {
      "capital": "Andorra la Vella",
      "country": "Andorra",
      "continent": "europe"
    },
    "history":
      "The landlocked Principality of Andorra is one of the smallest states in Europe, nestled high in the Pyrenees Mountains between the French and Spanish borders. For 715 years, from 1278 to 1993, Andorrans lived under a unique co-principality, ruled by French and Spanish leaders (from 1607 onward, the French chief of state and the Spanish bishop of Seu d''Urgell). In 1993, this feudal system was modified, with the titular heads of state retained, but the government transformed into a parliamentary democracy. In the late 20th century, Andorra became a popular tourist destination. An estimated 10 million people visit each year drawn by the winter sports, summer climate, and duty free goods. Andorra has also become a wealthy international commercial center because of its banking facilities, low taxes, and lack of customs duties. However, recent economic hardships have required Andorra to start taxing foreign investments and to implement stricter economic policies. Andorra is not a member of the European Union, but enjoys a special relationship with it and uses the Euro as its national currency.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/489521.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/162453.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3162219.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2023040.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1788986.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1186339.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/45382.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/509561.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [16.37, 48.21] },
    "properties": {
      "capital": "Vienna",
      "country": "Austria",
      "continent": "europe"
    },
    "history":
      "Once the center of power for the large Austro-Hungarian Empire, Austria was reduced to a small republic after its defeat in World War I. Following annexation by Nazi Germany in 1938 and subsequent occupation by the victorious Allies in 1945, Austria's status remained unclear for a decade. A State Treaty signed in 1955 ended the occupation, recognized Austria''s independence, and forbade unification with Germany. A constitutional law that same year declared the country''s \"perpetual neutrality\" as a condition for Soviet military withdrawal. The Soviet Union''s collapse in 1991 and Austria''s entry into the European Union in 1995 have altered the meaning of this neutrality. A prosperous, democratic country, Austria entered the EU Economic and Monetary Union in 1999.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/42049940.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/42050073.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/6554104.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/34354314.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/10138075.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/10138067.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/34352831.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/34352453.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [27.57, 53.9] },
    "properties": {
      "capital": "Minsk",
      "country": "Belarus",
      "continent": "europe"
    },
    "history":
      "After seven decades as a constituent republic of the USSR, Belarus attained its independence in 1991. It has retained closer political and economic ties to Russia than any of the other former Soviet republics. Belarus and Russia signed a treaty on a two-state union on 8 December 1999 envisioning greater political and economic integration. Although Belarus agreed to a framework to carry out the accord, serious implementation has yet to take place. Since his election in July 1994 as the country's first president, Aleksandr LUKASHENKO has steadily consolidated his power through authoritarian means. Government restrictions on freedom of speech and the press, peaceful assembly, and religion remain in place.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/250136.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/202153.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2164530.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3386532.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/799059.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3386455.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/799019.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/250100.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [4.35, 50.85] },
    "properties": {
      "capital": "Brussels",
      "country": "Belgium",
      "continent": "europe"
    },
    "history":
      "Belgium became independent from the Netherlands in 1830; it was occupied by Germany during World Wars I and II. The country prospered in the past half century as a modern, technologically advanced European state and member of NATO and the EU. Tensions between the Dutch-speaking Flemings of the north and the French-speaking Walloons of the south have led in recent years to constitutional amendments granting these regions formal recognition and autonomy. Its capital, Brussels, is home to numerous international organizations including the EU and NATO.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/2340393.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/492761.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/17384.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2349704.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/459577.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/17386.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/459526.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3156915.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [18.36, 43.85] },
    "properties": {
      "capital": "Sarajevo",
      "country": "Bosnia and Herzegovina",
      "continent": "europe"
    },
    "history":
      "Bosnia and Herzegovina's declaration of sovereignty in October 1991 was followed by a declaration of independence from the former Yugoslavia on 3 March 1992 after a referendum boycotted by ethnic Serbs. The Bosnian Serbs - supported by neighboring Serbia and Montenegro - responded with armed resistance aimed at partitioning the republic along ethnic lines and joining Serb-held areas to form a \"Greater Serbia.\" In March 1994, Bosniaks and Croats reduced the number of warring factions from three to two by signing an agreement creating a joint Bosniak/Croat Federation of Bosnia and Herzegovina. On 21 November 1995, in Dayton, Ohio, the warring parties initialed a peace agreement that brought to a halt three years of interethnic civil strife (the final agreement was signed in Paris on 14 December 1995). The Dayton Peace Accords retained Bosnia and Herzegovina''s international boundaries and created a multi-ethnic and democratic government charged with conducting foreign, diplomatic, and fiscal policy. Also recognized was a second tier of government composed of two entities roughly equal in size: the Bosniak/Bosnian Croat Federation of Bosnia and Herzegovina and the Bosnian Serb-led Republika Srpska (RS). The Federation and RS governments are responsible for overseeing most government functions. Additionally, the Dayton Accords established the Office of the High Representative (OHR) to oversee the implementation of the civilian aspects of the agreement. The Peace Implementation Council (PIC) at its conference in Bonn in 1997 also gave the High Representative the authority to impose legislation and remove officials, the so-called \"Bonn Powers.\" An original NATO-led international peacekeeping force (IFOR) of 60,000 troops assembled in 1995 was succeeded over time by a smaller, NATO-led Stabilization Force (SFOR). In 2004, European Union peacekeeping troops (EUFOR) replaced SFOR. Currently EUFOR deploys around 600 troops in theater in a policing capacity.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/7483310.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/8156454.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/117402.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/9211311.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/7357510.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/7446752.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/7440266.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/7789096.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [23.32, 42.7] },
    "properties": {
      "capital": "Sofia",
      "country": "Bulgaria",
      "continent": "europe"
    },
    "history":
      "The Bulgars, a Central Asian Turkic tribe, merged with the local Slavic inhabitants in the late 7th century to form the first Bulgarian state. In succeeding centuries, Bulgaria struggled with the Byzantine Empire to assert its place in the Balkans, but by the end of the 14th century the country was overrun by the Ottoman Turks. Northern Bulgaria attained autonomy in 1878 and all of Bulgaria became independent from the Ottoman Empire in 1908. Having fought on the losing side in both World Wars, Bulgaria fell within the Soviet sphere of influence and became a People's Republic in 1946. Communist domination ended in 1990, when Bulgaria held its first multiparty election since World War II and began the contentious process of moving toward political democracy and a market economy while combating inflation, unemployment, corruption, and crime. The country joined NATO in 2004 and the EU in 2007.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/6171110.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/7273996.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/7273847.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5602222.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/7274057.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/873699.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3878954.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/851244.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [15.98, 45.81] },
    "properties": {
      "capital": "Zagreb",
      "country": "Croatia",
      "continent": "europe"
    },
    "history":
      "The lands that today comprise Croatia were part of the Austro-Hungarian Empire until the close of World War I. In 1918, the Croats, Serbs, and Slovenes formed a kingdom known after 1929 as Yugoslavia. Following World War II, Yugoslavia became a federal independent Communist state under the strong hand of Marshal TITO. Although Croatia declared its independence from Yugoslavia in 1991, it took four years of sporadic, but often bitter, fighting before occupying Serb armies were mostly cleared from Croatian lands, along with a majority of Croatia's ethnic Serb population. Under UN supervision, the last Serb-held enclave in eastern Slavonia was returned to Croatia in 1998. In April 2009, Croatia joined NATO; Croatia signed the EU Accession Treaty in December 2011 and ratified the Treaty in January, 2012. Croatia will become a member after all 27 EU members ratify the treaty, with a target date of July 2013.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/6004.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5999.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5512130.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1326660.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/6003.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/726572.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/4068206.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5998.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [33.37, 35.17] },
    "properties": {
      "capital": "Nicosia",
      "country": "Cyprus",
      "continent": "europe"
    },
    "history":
      "A former British colony, Cyprus became independent in 1960 following years of resistance to British rule. Tensions between the Greek Cypriot majority and Turkish Cypriot minority came to a head in December 1963, when violence broke out in the capital of Nicosia. Despite the deployment of UN peacekeepers in 1964, sporadic intercommunal violence continued forcing most Turkish Cypriots into enclaves throughout the island. In 1974, a Greek Government-sponsored attempt to seize control of Cyprus was met by military intervention from Turkey, which soon controlled more than a third of the island. In 1983, the Turkish Cypriot-occupied area declared itself the \"Turkish Republic of Northern Cyprus\" (\"TRNC\"), but it is recognized only by Turkey. The election of a new Cypriot president in 2008 served as the impetus for the UN to encourage both the Greek Cypriot and Turkish Cypriot communities to reopen unification negotiations. In September 2008, the leaders of the two communities began discussions under UN auspices aimed at reuniting the divided island. The talks are ongoing. The entire island entered the EU on 1 May 2004, although the EU acquis - the body of common rights and obligations - applies only to the areas under the internationally recognized government, and is suspended in the areas administered by Turkish Cypriots. However, individual Turkish Cypriots able to document their eligibility for Republic of Cyprus citizenship legally enjoy the same rights accorded to other citizens of European Union states.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/7482140.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/7062469.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/7610775.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/7699591.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1514273.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1970801.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/4095941.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/4095883.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [14.42, 50.09] },
    "properties": {
      "capital": "Prague",
      "country": "Czech Republic",
      "continent": "europe"
    },
    "history":
      "At the close of World War I, the Czechs and Slovaks of the former Austro-Hungarian Empire merged to form Czechoslovakia. During the interwar years, having rejected a federal system, the new country's predominantly Czech leaders were frequently preoccupied with meeting the increasingly strident demands of other ethnic minorities within the republic, most notably the Slovaks, the Sudeten Germans, and the Ruthenians (Ukrainians). On the eve of World War II, Nazi Germany occupied the Czech part of the country and Slovakia became an independent state allied with Germany. After the war, a reunited but truncated Czechoslovakia (less Ruthenia) fell within the Soviet sphere of influence. In 1968, an invasion by Warsaw Pact troops ended the efforts of the country''s leaders to liberalize Communist rule and create \"socialism with a human face,\" ushering in a period of repression known as \"normalization.\" The peaceful \"Velvet Revolution\" swept the Communist Party from power at the end of 1989 and inaugurated a return to democratic rule and a market economy. On 1 January 1993, the country underwent a nonviolent \"velvet divorce\" into its two national components, the Czech Republic and Slovakia. The Czech Republic joined NATO in 1999 and the European Union in 2004.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/3544554.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/4880747.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/856688.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1698350.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/37720592.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/32398089.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/6635452.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/4522144.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [12.57, 55.68] },
    "properties": {
      "capital": "Copenhagen",
      "country": "Denmark",
      "continent": "europe"
    },
    "history":
      "Once the seat of Viking raiders and later a major north European power, Denmark has evolved into a modern, prosperous nation that is participating in the general political and economic integration of Europe. It joined NATO in 1949 and the EEC (now the EU) in 1973. However, the country has opted out of certain elements of the European Union's Maastricht Treaty, including the European Economic and Monetary Union (EMU), European defense cooperation, and issues concerning certain justice and home affairs.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/1079825.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/858436.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/173410.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/112881.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/62651.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/287311.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2181627.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1136307.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [24.75, 59.44] },
    "properties": {
      "capital": "Tallinn",
      "country": "Estonia",
      "continent": "europe"
    },
    "history":
      "After centuries of Danish, Swedish, German, and Russian rule, Estonia attained independence in 1918. Forcibly incorporated into the USSR in 1940 - an action never recognized by the US - it regained its freedom in 1991 with the collapse of the Soviet Union. Since the last Russian troops left in 1994, Estonia has been free to promote economic and political ties with the West. It joined both NATO and the EU in the spring of 2004, formally joined the OECD in late 2010, and adopted the euro as its official currency on 1 January 2011.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/2092325.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2092193.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2563138.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/288419.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2463902.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/856075.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/975826.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2408000.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [-6.77, 62.01] },
    "properties": {
      "capital": "Tórshavn",
      "country": "Faroe Islands",
      "continent": "europe"
    },
    "history":
      "The population of the Faroe Islands is largely descended from Viking settlers who arrived in the 9th century. The islands have been connected politically to Denmark since the 14th century. A high degree of self-government was granted the Faroese in 1948, who have autonomy over most internal affairs while Denmark is responsible for justice, defense, and foreign affairs. The Faroe Islands are not part of the European Union.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/2583756.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1031976.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1031831.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1344998.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1470486.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/13603.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1470541.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/438603.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [24.94, 60.17] },
    "properties": {
      "capital": "Helsinki",
      "country": "Finland",
      "continent": "europe"
    },
    "history":
      "Finland was a province and then a grand duchy under Sweden from the 12th to the 19th centuries, and an autonomous grand duchy of Russia after 1809. It won its complete independence in 1917. During World War II, it was able to successfully defend its freedom and resist invasions by the Soviet Union - albeit with some loss of territory. In the subsequent half century, the Finns made a remarkable transformation from a farm/forest economy to a diversified modern industrial economy; per capita income is now among the highest in Western Europe. A member of the European Union since 1995, Finland was the only Nordic state to join the euro system at its initiation in January 1999. In the 21st century, the key features of Finland's modern welfare state are a high standard of education, equality promotion, and national social security system - currently challenged by an aging population and the fluctuations of an export-driven economy.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/922365.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/59004.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/922387.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/999002.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/59002.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/59041.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/59001.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/58997.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [2.35, 48.85] },
    "properties": {
      "capital": "Paris",
      "country": "France",
      "continent": "europe"
    },
    "history":
      "France today is one of the most modern countries in the world and is a leader among European nations. It plays an influential global role as a permanent member of the United Nations Security Council, NATO, the G-8, the G-20, the EU and other multilateral organizations. France rejoined NATO's integrated military command structure in 2009, reversing de Gaulle''s 1966 decision to take French forces out of NATO. Since 1958, it has constructed a hybrid presidential-parliamentary governing system resistant to the instabilities experienced in earlier, more purely parliamentary administrations. In recent decades, its reconciliation and cooperation with Germany have proved central to the economic integration of Europe, including the introduction of a common currency, the euro, in January 1999. In the early 21st century, five French overseas entities - French Guiana, Guadeloupe, Martinique, Mayotte, and Reunion - became French regions and were made part of France proper.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/3112589.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3691458.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/12052.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/4504078.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/36026.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/649957.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/10990856.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2589147.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [13.41, 52.52] },
    "properties": {
      "capital": "Berlin",
      "country": "Germany",
      "continent": "europe"
    },
    "history":
      "As Europe's largest economy and second most populous nation (after Russia), Germany is a key member of the continent''s economic, political, and defense organizations. European power struggles immersed Germany in two devastating World Wars in the first half of the 20th century and left the country occupied by the victorious Allied powers of the US, UK, France, and the Soviet Union in 1945. With the advent of the Cold War, two German states were formed in 1949: the western Federal Republic of Germany (FRG) and the eastern German Democratic Republic (GDR). The democratic FRG embedded itself in key Western economic and security organizations, the EC, which became the EU, and NATO, while the Communist GDR was on the front line of the Soviet-led Warsaw Pact. The decline of the USSR and the end of the Cold War allowed for German unification in 1990. Since then, Germany has expended considerable funds to bring Eastern productivity and wages up to Western standards. In January 1999, Germany and 10 other EU countries introduced a common European exchange currency, the euro.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/2940862.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3842091.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/4483994.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1398730.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2727497.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2887389.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3869316.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1953613.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [-5.35, 36.14] },
    "properties": {
      "capital": "Gibraltar",
      "country": "Gibraltar",
      "continent": "europe"
    },
    "history":
      "Strategically important, Gibraltar was reluctantly ceded to Great Britain by Spain in the 1713 Treaty of Utrecht; the British garrison was formally declared a colony in 1830. In a referendum held in 1967, Gibraltarians voted overwhelmingly to remain a British dependency. The subsequent granting of autonomy in 1969 by the UK led to Spain closing the border and severing all communication links. Between 1997 and 2002, the UK and Spain held a series of talks on establishing temporary joint sovereignty over Gibraltar. In response to these talks, the Gibraltar Government called a referendum in late 2002 in which the majority of citizens voted overwhelmingly against any sharing of sovereignty with Spain. Since late 2004, Spain, the UK, and Gibraltar have held tripartite talks with the aim of cooperatively resolving problems that affect the local population, and work continues on cooperation agreements in areas such as taxation and financial services; communications and maritime security; policy, legal and customs services; environmental protection; and education and visa services. Throughout 2009, a dispute over Gibraltar's claim to territorial waters extending out three miles gave rise to periodic non-violent maritime confrontations between Spanish and UK naval patrols. A new noncolonial constitution came into effect in 2007, and the European Court of First Instance recognized Gibraltar''s right to regulate its own tax regime in December 2008. The UK retains responsibility for defense, foreign relations, internal security, and financial stability.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/59372.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/59369.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/59368.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/59371.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/961989.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1509970.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/12914.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1400577.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [23.72, 37.98] },
    "properties": {
      "capital": "Athens",
      "country": "Greece",
      "continent": "europe"
    },
    "history":
      "Greece achieved independence from the Ottoman Empire in 1830. During the second half of the 19th century and the first half of the 20th century, it gradually added neighboring islands and territories, most with Greek-speaking populations. In World War II, Greece was first invaded by Italy (1940) and subsequently occupied by Germany (1941-44); fighting endured in a protracted civil war between supporters of the king and other anti-Communist and Communist rebels. Following the latter's defeat in 1949, Greece joined NATO in 1952. In 1967, a group of military officers seized power, establishing a military dictatorship that suspended many political liberties and forced the king to flee the country. In 1974, democratic elections and a referendum created a parliamentary republic and abolished the monarchy. In 1981, Greece joined the EC (now the EU); it became the 12th member of the European Economic and Monetary Union in 2001. In 2010, the prospect of a Greek default on its euro-denominated debt created severe strains within the EMU and raised the question of whether a member country might voluntarily leave the common currency or be removed.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/676833.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2787151.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1064509.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1052045.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/234014.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/83392.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1368358.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1720573.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [-2.54, 49.46] },
    "properties": {
      "capital": "St Peter Port",
      "country": "Guernsey",
      "continent": "europe"
    },
    "history":
      "Guernsey and the other Channel Islands represent the last remnants of the medieval Dukedom of Normandy, which held sway in both France and England. The islands were the only British soil occupied by German troops in World War II. Guernsey is a British crown dependency but is not part of the UK or of the European Union. However, the UK Government is constitutionally responsible for its defense and international representation.",
    "images": []
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [19.04, 47.5] },
    "properties": {
      "capital": "Budapest",
      "country": "Hungary",
      "continent": "europe"
    },
    "history":
      "Hungary became a Christian kingdom in A.D. 1000 and for many centuries served as a bulwark against Ottoman Turkish expansion in Europe. The kingdom eventually became part of the polyglot Austro-Hungarian Empire, which collapsed during World War I. The country fell under Communist rule following World War II. In 1956, a revolt and an announced withdrawal from the Warsaw Pact were met with a massive military intervention by Moscow. Under the leadership of Janos KADAR in 1968, Hungary began liberalizing its economy, introducing so-called \"Goulash Communism.\" Hungary held its first multiparty elections in 1990 and initiated a free market economy. It joined NATO in 1999 and the EU five years later. In 2011, Hungary assumed the six-month rotating presidency of the EU for the first time.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/21073597.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/8959572.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/21073930.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/21450196.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/36666.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/24969556.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/4612109.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/15413009.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [-21.9, 64.14] },
    "properties": {
      "capital": "Reykjavík",
      "country": "Iceland",
      "continent": "europe"
    },
    "history":
      "Settled by Norwegian and Celtic (Scottish and Irish) immigrants during the late 9th and 10th centuries A.D., Iceland boasts the world's oldest functioning legislative assembly, the Althing, established in 930. Independent for over 300 years, Iceland was subsequently ruled by Norway and Denmark. Fallout from the Askja volcano of 1875 devastated the Icelandic economy and caused widespread famine. Over the next quarter century, 20% of the island''s population emigrated, mostly to Canada and the US. Denmark granted limited home rule in 1874 and complete independence in 1944. The second half of the 20th century saw substantial economic growth driven primarily by the fishing industry. The economy diversified greatly after the country joined the European Economic Area in 1994, but Iceland was especially hard hit by the global financial crisis in the years following 2008. Literacy, longevity, and social cohesion are first rate by world standards.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/5657668.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/274254.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3177089.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3177070.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/843394.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3177064.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/255488.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2013270.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [-6.25, 53.33] },
    "properties": {
      "capital": "Dublin",
      "country": "Ireland",
      "continent": "europe"
    },
    "history":
      "Celtic tribes arrived on the island between 600 and 150 B.C. Invasions by Norsemen that began in the late 8th century were finally ended when King Brian BORU defeated the Danes in 1014. English invasions began in the 12th century and set off more than seven centuries of Anglo-Irish struggle marked by fierce rebellions and harsh repressions. A failed 1916 Easter Monday Rebellion touched off several years of guerrilla warfare that in 1921 resulted in independence from the UK for 26 southern counties; six northern (Ulster) counties remained part of the UK. In 1949, Ireland withdrew from the British Commonwealth; it joined the European Community in 1973. Irish governments have sought the peaceful unification of Ireland and have cooperated with Britain against terrorist groups. A peace settlement for Northern Ireland is gradually being implemented despite some difficulties. In 2006, the Irish and British governments developed and began to implement the St. Andrews Agreement, building on the Good Friday Agreement approved in 1998.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/35695503.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/35691189.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/35211066.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/35685577.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/35211059.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/33251696.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/34599489.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/33251501.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [-4.48, 54.15] },
    "properties": {
      "capital": "Douglas",
      "country": "Isle of Man",
      "continent": "europe"
    },
    "history":
      "Part of the Norwegian Kingdom of the Hebrides until the 13th century when it was ceded to Scotland, the isle came under the British crown in 1765. Current concerns include reviving the almost extinct Manx Gaelic language. Isle of Man is a British crown dependency but is not part of the UK or of the European Union. However, the UK Government remains constitutionally responsible for its defense and international representation.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/3336826.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1089196.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1096213.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1530437.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/550774.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1530458.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1167933.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3423332.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [12.48, 41.89] },
    "properties": {
      "capital": "Rome",
      "country": "Italy",
      "continent": "europe"
    },
    "history":
      "Italy became a nation-state in 1861 when the regional states of the peninsula, along with Sardinia and Sicily, were united under King Victor EMMANUEL II. An era of parliamentary government came to a close in the early 1920s when Benito MUSSOLINI established a Fascist dictatorship. His alliance with Nazi Germany led to Italy's defeat in World War II. A democratic republic replaced the monarchy in 1946 and economic revival followed. Italy is a charter member of NATO and the European Economic Community (EEC). It has been at the forefront of European economic and political unification, joining the Economic and Monetary Union in 1999. Persistent problems include sluggish economic growth, high youth and female unemployment, organized crime, corruption, and economic disparities between southern Italy and the more prosperous north.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/24250596.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5119401.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/17530375.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1868621.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/18498834.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/15864178.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1988452.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [-2.1, 49.19] },
    "properties": {
      "capital": "Saint Helier",
      "country": "Jersey",
      "continent": "europe"
    },
    "history":
      "Jersey and the other Channel Islands represent the last remnants of the medieval Dukedom of Normandy that held sway in both France and England. These islands were the only British soil occupied by German troops in World War II. Jersey is a British crown dependency but is not part of the UK or of the European Union. However, the UK Government is constitutionally responsible for its defense and international representation.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/2435660.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2435683.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2435642.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/4311761.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2435804.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/535293.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/11787869.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2435788.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [21.17, 42.67] },
    "properties": {
      "capital": "Pristina",
      "country": "Kosovo",
      "continent": "europe"
    },
    "history":
      "The central Balkans were part of the Roman and Byzantine Empires before ethnic Serbs migrated to the territories of modern Kosovo in the 7th century. During the medieval period, Kosovo became the center of a Serbian Empire and saw the construction of many important Serb religious sites, including many architecturally significant Serbian Orthodox monasteries. The defeat of Serbian forces at the Battle of Kosovo in 1389 led to five centuries of Ottoman rule during which large numbers of Turks and Albanians moved to Kosovo. By the end of the 19th century, Albanians replaced the Serbs as the dominant ethnic group in Kosovo. Serbia reacquired control over Kosovo from the Ottoman Empire during the First Balkan War of 1912. After World War II, Kosovo became an autonomous province of Serbia in the Socialist Federal Republic of Yugoslavia (S.F.R.Y.) with status almost equivalent to that of a republic under the 1974 S.F.R.Y. constitution. Despite legislative concessions, Albanian nationalism increased in the 1980s, which led to riots and calls for Kosovo's independence. At the same time, Serb nationalist leaders, such as Slobodan MILOSEVIC, exploited Kosovo Serb claims of maltreatment to secure votes from supporters, many of whom viewed Kosovo as their cultural heartland. Under MILOSEVIC's leadership, Serbia instituted a new constitution in 1989 that revoked Kosovo's status as an autonomous province of Serbia. Kosovo's Albanian leaders responded in 1991 by organizing a referendum that declared Kosovo independent. Under MILOSEVIC, Serbia carried out repressive measures against the Kosovar Albanians in the early 1990s as the unofficial Kosovo government, led by Ibrahim RUGOVA, used passive resistance in an attempt to try to gain international assistance and recognition of an independent Kosovo. Albanians dissatisfied with RUGOVA's passive strategy in the 1990s created the Kosovo Liberation Army and launched an insurgency. Starting in 1998, Serbian military, police, and paramilitary forces under MILOSEVIC conducted a brutal counterinsurgency campaign that resulted in massacres and massive expulsions of ethnic Albanians. Approximately 800,000 Albanians were forced from their homes in Kosovo during this time. International attempts to mediate the conflict failed, and MILOSEVIC's rejection of a proposed settlement led to a three-month NATO military operation against Serbia beginning in March 1999 that forced Serbia to agree to withdraw its military and police forces from Kosovo. UN Security Council Resolution 1244 (1999) placed Kosovo under a transitional administration, the UN Interim Administration Mission in Kosovo (UNMIK), pending a determination of Kosovo's future status. A UN-led process began in late 2005 to determine Kosovo's final status. The negotiations ran in stages between 2006 and 2007, but ended without agreement between Belgrade and Pristina. On 17 February 2008, the Kosovo Assembly declared Kosovo independent. Since then, over 95 countries have recognized Kosovo, and it has joined the International Monetary Fund, World Bank, and European Bank for Reconstruction and Development, and is in the process of signing a framework agreement with the European Investment Bank (EIB). In October 2008, Serbia sought an advisory opinion from the International Court of Justice (ICJ) on the legality under international law of Kosovo's declaration of independence. The ICJ released the advisory opinion in July 2010 affirming that Kosovo's declaration of independence did not violate general principles of international law, UN Security Council Resolution 1244, or the Constitutive Framework. The opinion was closely tailored to Kosovo's unique history and circumstances. Serbia continues to reject Kosovo's independence, but the two countries are currently engaged in an EU-facilitated dialogue aimed at normalizing the countries' relations.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/4399454.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/12896229.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/6758429.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3648584.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2380722.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/12044910.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/10665610.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/16169363.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [24.11, 56.95] },
    "properties": {
      "capital": "Riga",
      "country": "Latvia",
      "continent": "europe"
    },
    "history":
      "The name \"Latvia\" originates from the ancient Latgalians, one of four eastern Baltic tribes that formed the ethnic core of the Latvian people (ca. 8th-12th centuries A.D.). The region subsequently came under the control of Germans, Poles, Swedes, and finally, Russians. A Latvian republic emerged following World War I, but it was annexed by the USSR in 1940 - an action never recognized by the US and many other countries. Latvia reestablished its independence in 1991 following the breakup of the Soviet Union. Although the last Russian troops left in 1994, the status of the Russian minority (some 28% of the population) remains of concern to Moscow. Latvia joined both NATO and the EU in the spring of 2004.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/33184107.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/19252150.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/18823569.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/8950104.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/519180.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2362605.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/773612.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/853177.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [9.52, 47.14] },
    "properties": {
      "capital": "Vaduz",
      "country": "Liechtenstein",
      "continent": "europe"
    },
    "history":
      "The Principality of Liechtenstein was established within the Holy Roman Empire in 1719. Occupied by both French and Russian troops during the Napoleonic Wars, it became a sovereign state in 1806 and joined the Germanic Confederation in 1815. Liechtenstein became fully independent in 1866 when the Confederation dissolved. Until the end of World War I, it was closely tied to Austria, but the economic devastation caused by that conflict forced Liechtenstein to enter into a customs and monetary union with Switzerland. Since World War II (in which Liechtenstein remained neutral), the country's low taxes have spurred outstanding economic growth. In 2000, shortcomings in banking regulatory oversight resulted in concerns about the use of financial institutions for money laundering. However, Liechtenstein implemented anti-money laundering legislation and a Mutual Legal Assistance Treaty with the US that went into effect in 2003.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/664378.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/664371.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/690220.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/664366.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1192111.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1054215.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3347240.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/21756.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [25.28, 54.69] },
    "properties": {
      "capital": "Vilnius",
      "country": "Lithuania",
      "continent": "europe"
    },
    "history":
      "Lithuanian lands were united under MINDAUGAS in 1236; over the next century, through alliances and conquest, Lithuania extended its territory to include most of present-day Belarus and Ukraine. By the end of the 14th century Lithuania was the largest state in Europe. An alliance with Poland in 1386 led the two countries into a union through the person of a common ruler. In 1569, Lithuania and Poland formally united into a single dual state, the Polish-Lithuanian Commonwealth. This entity survived until 1795 when its remnants were partitioned by surrounding countries. Lithuania regained its independence following World War I but was annexed by the USSR in 1940 - an action never recognized by the US and many other countries. On 11 March 1990, Lithuania became the first of the Soviet republics to declare its independence, but Moscow did not recognize this proclamation until September of 1991 (following the abortive coup in Moscow). The last Russian troops withdrew in 1993. Lithuania subsequently restructured its economy for integration into Western European institutions; it joined both NATO and the EU in the spring of 2004.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/6030853.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/519962.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/838671.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/234270.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/776516.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5141149.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5183640.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1066588.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [6.13, 49.61] },
    "properties": {
      "capital": "Luxembourg",
      "country": "Luxembourg",
      "continent": "europe"
    },
    "history":
      "Founded in 963, Luxembourg became a grand duchy in 1815 and an independent state under the Netherlands. It lost more than half of its territory to Belgium in 1839 but gained a larger measure of autonomy. Full independence was attained in 1867. Overrun by Germany in both world wars, it ended its neutrality in 1948 when it entered into the Benelux Customs Union and when it joined NATO the following year. In 1957, Luxembourg became one of the six founding countries of the European Economic Community (later the European Union), and in 1999 it joined the euro currency area. In January 2013, Luxembourg assumed a nonpermanent seat on the UN Security Council for the 2013-14 term.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/2460181.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2185688.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2099631.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1271177.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/252026.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2460108.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2460137.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2460148.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [21.43, 42] },
    "properties": {
      "capital": "Skopje",
      "country": "Macedonia",
      "continent": "europe"
    },
    "history":
      "Macedonia gained its independence peacefully from Yugoslavia in 1991. Greece's objection to the new state''s use of what it considered a Hellenic name and symbols delayed international recognition, which occurred under the provisional designation of \"the Former Yugoslav Republic of Macedonia.\" In 1995, Greece lifted a 20-month trade embargo and the two countries agreed to normalize relations, but the issue of the name remained unresolved and negotiations for a solution are ongoing. Since 2004, the United States and 133 other nations have recognized Macedonia by its constitutional name, Republic of Macedonia. Some ethnic Albanians, angered by perceived political and economic inequities, launched an insurgency in 2001 that eventually won the support of the majority of Macedonia''s ethnic Albanian population and led to the internationally brokered Ohrid Framework Agreement, which ended the fighting and established guidelines for the creation of new laws that enhanced the rights of minorities. Fully implementing the Framework Agreement, maintaining momentum on democratic reforms, and stimulating economic growth and development continue to be challenges for Macedonia, although progress has been made over the past several years.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/38297108.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/38180809.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/35127146.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2871624.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/9368938.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/44941480.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/38575912.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/34781117.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [14.51, 35.9] },
    "properties": {
      "capital": "Valletta",
      "country": "Malta",
      "continent": "europe"
    },
    "history":
      "Great Britain formally acquired possession of Malta in 1814. The island staunchly supported the UK through both world wars and remained in the Commonwealth when it became independent in 1964. A decade later Malta became a republic. Since about the mid-1980s, the island has transformed itself into a freight transshipment point, a financial center, and a tourist destination. Malta became an EU member in May 2004 and began using the euro as currency in 2008.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/2192569.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2929877.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2276138.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/276485.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2192638.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2276154.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/6566198.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [28.86, 47.01] },
    "properties": {
      "capital": "Chişinău",
      "country": "Moldova",
      "continent": "europe"
    },
    "history":
      "Part of Romania during the interwar period, Moldova was incorporated into the Soviet Union at the close of World War II. Although the country has been independent from the USSR since 1991, Russian forces have remained on Moldovan territory east of the Nistru River supporting a Transnistrian separatist region composed of a Slavic majority population (mostly Ukrainians and Russians), but with a sizeable ethnic Moldovan minority. One of the poorest nations in Europe, Moldova became the first former Soviet state to elect a Communist, Vladimir VORONIN, as its president in 2001. VORONIN served as Moldova's president until he resigned in September 2009, following the opposition''s gain of a narrow majority in July parliamentary elections and the Communist Party''s (PCRM) subsequent inability to attract the three-fifths of parliamentary votes required to elect a president. Four Moldovan opposition parties formed a new coalition, the Alliance for European Integration (AEI), which has acted as Moldova''s governing coalition since. Moldova experienced significant political uncertainty between 2009 and early 2012, holding three general elections and numerous presidential ballots in parliament, all of which failed to secure a president. Following November 2010 parliamentary elections, a reconstituted AEI-coalition consisting of three of the four original AEI parties formed a government, and in March 2012 was finally able to elect an independent as president.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/2378176.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/855523.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5185377.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5648721.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5185387.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/4358058.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2930472.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2925025.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [7.42, 43.73] },
    "properties": {
      "capital": "Monaco",
      "country": "Monaco",
      "continent": "europe"
    },
    "history":
      "The Genoese built a fortress on the site of present day Monaco in 1215. The current ruling Grimaldi family first seized temporary control in 1297, and again in 1331, but were not able to permanently secure their holding until 1419. Economic development was spurred in the late 19th century with a railroad linkup to France and the opening of a casino. Since then, the principality's mild climate, splendid scenery, and gambling facilities have made Monaco world famous as a tourist and recreation center.",
    "images": []
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [19.26, 42.44] },
    "properties": {
      "capital": "Podgorica",
      "country": "Montenegro",
      "continent": "europe"
    },
    "history":
      "The use of the name Crna Gora (Montenegro) began in the 13th century in reference to a highland region in the Serbian province of Zeta. The later medieval state of Zeta maintained its existence until 1496 when Montenegro finally fell under Ottoman rule. Over subsequent centuries, Montenegro, while a part of the Ottoman Empire, was able to maintain a level of autonomy. From the 16th to 19th centuries, Montenegro was a theocracy ruled by a series of bishop princes; in 1852, it was transformed into a secular principality. Montenegro was recognized as an independent sovereign principality at the Congress of Berlin in 1878. After World War I, during which Montenegro fought on the side of the Allies, Montenegro was absorbed by the Kingdom of Serbs, Croats, and Slovenes, which became the Kingdom of Yugoslavia in 1929; at the conclusion of World War II, it became a constituent republic of the Socialist Federal Republic of Yugoslavia. When the latter dissolved in 1992, Montenegro federated with Serbia, first as the Federal Republic of Yugoslavia and, after 2003, in a looser State Union of Serbia and Montenegro. In May 2006, Montenegro invoked its right under the Constitutional Charter of Serbia and Montenegro to hold a referendum on independence from the state union. The vote for severing ties with Serbia barely exceeded 55% - the threshold set by the EU - allowing Montenegro to formally restore its independence on 3 June 2006.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/10946337.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/10945291.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/10946433.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/10946355.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/10946332.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/6883679.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/10946437.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/10945404.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [4.89, 52.37] },
    "properties": {
      "capital": "Amsterdam",
      "country": "Netherlands",
      "continent": "europe"
    },
    "history":
      "The Dutch United Provinces declared their independence from Spain in 1579; during the 17th century, they became a leading seafaring and commercial power, with settlements and colonies around the world. After a 20-year French occupation, a Kingdom of the Netherlands was formed in 1815. In 1830 Belgium seceded and formed a separate kingdom. The Netherlands remained neutral in World War I, but suffered invasion and occupation by Germany in World War II. A modern, industrialized nation, the Netherlands is also a large exporter of agricultural products. The country was a founding member of NATO and the EEC (now the EU) and participated in the introduction of the euro in 1999. In October 2010, the former Netherlands Antilles was dissolved and the three smallest islands - Bonaire, Sint Eustatius, and Saba - became special municipalities in the Netherlands administrative structure. The larger islands of Sint Maarten and Curacao joined the Netherlands and Aruba as constituent countries forming the Kingdom of the Netherlands.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/495119.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5886688.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/208432.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1191472.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/6688138.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5417904.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3032525.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1484296.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [10.75, 59.91] },
    "properties": {
      "capital": "Oslo",
      "country": "Norway",
      "continent": "europe"
    },
    "history":
      "Two centuries of Viking raids into Europe tapered off following the adoption of Christianity by King Olav TRYGGVASON in 994. Conversion of the Norwegian kingdom occurred over the next several decades. In 1397, Norway was absorbed into a union with Denmark that lasted more than four centuries. In 1814, Norwegians resisted the cession of their country to Sweden and adopted a new constitution. Sweden then invaded Norway but agreed to let Norway keep its constitution in return for accepting the union under a Swedish king. Rising nationalism throughout the 19th century led to a 1905 referendum granting Norway independence. Although Norway remained neutral in World War I, it suffered heavy losses to its shipping. Norway proclaimed its neutrality at the outset of World War II, but was nonetheless occupied for five years by Nazi Germany (1940-45). In 1949, neutrality was abandoned and Norway became a member of NATO. Discovery of oil and gas in adjacent waters in the late 1960s boosted Norway's economic fortunes. In referenda held in 1972 and 1994, Norway rejected joining the EU. Key domestic issues include immigration and integration of ethnic minorities, maintaining the country''s extensive social safety net with an aging population, and preserving economic competitiveness.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/58750.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1445036.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/58746.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/58752.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2391882.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2391816.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2391763.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/307371.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [21.01, 52.23] },
    "properties": {
      "capital": "Warsaw",
      "country": "Poland",
      "continent": "europe"
    },
    "history":
      "Poland's history as a state begins near the middle of the 10th century. By the mid-16th century, the Polish-Lithuanian Commonwealth ruled a vast tract of land in central and eastern Europe. During the 18th century, internal disorders weakened the nation, and in a series of agreements between 1772 and 1795, Russia, Prussia, and Austria partitioned Poland among themselves. Poland regained its independence in 1918 only to be overrun by Germany and the Soviet Union in World War II. It became a Soviet satellite state following the war, but its government was comparatively tolerant and progressive. Labor turmoil in 1980 led to the formation of the independent trade union \"Solidarity\" that over time became a political force with over ten million members. Free elections in 1989 and 1990 won Solidarity control of the parliament and the presidency, bringing the Communist era to a close. A \"shock therapy\" program during the early 1990s enabled the country to transform its economy into one of the most robust in Central Europe. Poland joined NATO in 1999 and the European Union in 2004. With its transformation to a democratic, market-oriented country largely completed, Poland is an increasingly active member of Euro-Atlantic organizations.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/4888031.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/4152097.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3788405.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2172985.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1707075.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5247597.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2980934.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/4152454.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [-9.13, 38.72] },
    "properties": {
      "capital": "Lisbon",
      "country": "Portugal",
      "continent": "europe"
    },
    "history":
      "Following its heyday as a global maritime power during the 15th and 16th centuries, Portugal lost much of its wealth and status with the destruction of Lisbon in a 1755 earthquake, occupation during the Napoleonic Wars, and the independence of its wealthiest colony of Brazil in 1822. A 1910 revolution deposed the monarchy; for most of the next six decades, repressive governments ran the country. In 1974, a left-wing military coup installed broad democratic reforms. The following year, Portugal granted independence to all of its African colonies. Portugal is a founding member of NATO and entered the EC (now the EU) in 1986.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/597679.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/90769.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/4976850.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/486601.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5425651.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3098498.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3983464.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5345523.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [26.11, 44.43] },
    "properties": {
      "capital": "Bucharest",
      "country": "Romania",
      "continent": "europe"
    },
    "history":
      "The principalities of Wallachia and Moldavia - for centuries under the suzerainty of the Turkish Ottoman Empire - secured their autonomy in 1856; they were de facto linked in 1859 and formally united in 1862 under the new name of Romania. The country gained recognition of its independence in 1878. It joined the Allied Powers in World War I and acquired new territories - most notably Transylvania - following the conflict. In 1940, Romania allied with the Axis powers and participated in the 1941 German invasion of the USSR. Three years later, overrun by the Soviets, Romania signed an armistice. The post-war Soviet occupation led to the formation of a Communist \"people's republic\" in 1947 and the abdication of the king. The decades-long rule of dictator Nicolae CEAUSESCU, who took power in 1965, and his Securitate police state became increasingly oppressive and draconian through the 1980s. CEAUSESCU was overthrown and executed in late 1989. Former Communists dominated the government until 1996 when they were swept from power. Romania joined NATO in 2004 and the EU in 2007.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/1149134.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1149189.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1149238.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1149094.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/881760.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/443681.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/914032.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/44881.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [37.62, 55.75] },
    "properties": {
      "capital": "Moscow",
      "country": "Russia",
      "continent": "europe"
    },
    "history":
      "Founded in the 12th century, the Principality of Muscovy, was able to emerge from over 200 years of Mongol domination (13th-15th centuries) and to gradually conquer and absorb surrounding principalities. In the early 17th century, a new Romanov Dynasty continued this policy of expansion across Siberia to the Pacific. Under PETER I (ruled 1682-1725), hegemony was extended to the Baltic Sea and the country was renamed the Russian Empire. During the 19th century, more territorial acquisitions were made in Europe and Asia. Defeat in the Russo-Japanese War of 1904-05 contributed to the Revolution of 1905, which resulted in the formation of a parliament and other reforms. Repeated devastating defeats of the Russian army in World War I led to widespread rioting in the major cities of the Russian Empire and to the overthrow in 1917 of the imperial household. The Communists under Vladimir LENIN seized power soon after and formed the USSR. The brutal rule of Iosif STALIN (1928-53) strengthened Communist rule and Russian dominance of the Soviet Union at a cost of tens of millions of lives. The Soviet economy and society stagnated in the following decades until General Secretary Mikhail GORBACHEV (1985-91) introduced glasnost (openness) and perestroika (restructuring) in an attempt to modernize Communism, but his initiatives inadvertently released forces that by December 1991 splintered the USSR into Russia and 14 other independent republics. Since then, Russia has shifted its post-Soviet democratic ambitions in favor of a centralized semi-authoritarian state in which the leadership seeks to legitimize its rule through managed national elections, populist appeals by President PUTIN, and continued economic growth. Russia has severely disabled a Chechen rebel movement, although violence still occurs throughout the North Caucasus.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/189245.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1029539.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1206397.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/375607.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1930341.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2176212.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1251300.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2387828.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [12.45, 43.94] },
    "properties": {
      "capital": "San Marino",
      "country": "San Marino",
      "continent": "europe"
    },
    "history":
      "Geographically the third smallest state in Europe (after the Holy See and Monaco), San Marino also claims to be the world's oldest republic. According to tradition, it was founded by a Christian stonemason named Marinus in A.D. 301. San Marino''s foreign policy is aligned with that of the European Union, although it is not a member; social and political trends in the republic track closely with those of its larger neighbor, Italy.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/245555.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/999900.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/999871.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/999917.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2541269.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/688745.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/258475.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1460163.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [20.47, 44.8] },
    "properties": {
      "capital": "Belgrade",
      "country": "Serbia",
      "continent": "europe"
    },
    "history": "",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/1230589.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/209737.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5766621.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5766781.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/6893956.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5767885.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5766463.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/5766420.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [17.11, 48.15] },
    "properties": {
      "capital": "Bratislava",
      "country": "Slovakia",
      "continent": "europe"
    },
    "history":
      "Slovakia's roots can be traced to the 9th century state of Great Moravia. Subsequently, the Slovaks became part of the Hungarian Kingdom, where they remained for the next 1,000 years. Following the formation of the dual Austro-Hungarian monarchy in 1867, language and education policies favoring the use of Hungarian (Magyarization) resulted in a strengthening of Slovak nationalism and a cultivation of cultural ties with the closely related Czechs, who were under Austrian rule. After the dissolution of the Austro-Hungarian Empire at the close of World War I, the Slovaks joined the Czechs to form Czechoslovakia. During the interwar period, Slovak nationalist leaders pushed for autonomy within Czechoslovakia, and in 1939 Slovakia became an independent state allied with Nazi Germany. Following World War II, Czechoslovakia was reconstituted and came under communist rule within Soviet-dominated Eastern Europe. In 1968, an invasion by Warsaw Pact troops ended the efforts of the country''s leaders to liberalize communist rule and create \"socialism with a human face,\" ushering in a period of repression known as \"normalization.\" The peaceful \"Velvet Revolution\" swept the Communist Party from power at the end of 1989 and inaugurated a return to democratic rule and a market economy. On 1 January 1993, the country underwent a nonviolent \"velvet divorce\" into its two national components, Slovakia and the Czech Republic. Slovakia joined both NATO and the EU in the spring of 2004 and the euro zone on 1 January 2009.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/4335662.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1069942.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/4335689.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/963999.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/53237.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/53238.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/242441.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/667030.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [14.51, 46.05] },
    "properties": {
      "capital": "Ljubljana",
      "country": "Slovenia",
      "continent": "europe"
    },
    "history":
      "The Slovene lands were part of the Austro-Hungarian Empire until the latter's dissolution at the end of World War I. In 1918, the Slovenes joined the Serbs and Croats in forming a new multinational state, which was named Yugoslavia in 1929. After World War II, Slovenia became a republic of the renewed Yugoslavia, which though communist, distanced itself from Moscow''s rule. Dissatisfied with the exercise of power by the majority Serbs, the Slovenes succeeded in establishing their independence in 1991 after a short 10-day war. Historical ties to Western Europe, a strong economy, and a stable democracy have assisted in Slovenia''s transformation to a modern state. Slovenia acceded to both NATO and the EU in the spring of 2004; it joined the eurozone in 2007.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/482302.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2025961.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/184300.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/482390.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2025970.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2400394.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/623760.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/784740.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [-3.7, 40.42] },
    "properties": {
      "capital": "Madrid",
      "country": "Spain",
      "continent": "europe"
    },
    "history":
      "Spain's powerful world empire of the 16th and 17th centuries ultimately yielded command of the seas to England. Subsequent failure to embrace the mercantile and industrial revolutions caused the country to fall behind Britain, France, and Germany in economic and political power. Spain remained neutral in World Wars I and II but suffered through a devastating civil war (1936-39). A peaceful transition to democracy following the death of dictator Francisco FRANCO in 1975, and rapid economic modernization (Spain joined the EU in 1986) gave Spain a dynamic and rapidly growing economy and made it a global champion of freedom and human rights. More recently the government has had to focus on measures to reverse a severe economic recession that began in mid-2008. Austerity measures implemented to reduce a large budget deficit and reassure foreign investors have led to one of the highest unemployment rates in Europe.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/19579998.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/19587061.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/110926.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/16570102.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/31934908.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/18473873.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/4940361.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/21576844.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [15.64, 78.22] },
    "properties": {
      "capital": "Longyearbyen",
      "country": "Svalbard and Jan Mayen",
      "continent": "europe"
    },
    "history":
      "First discovered by the Norwegians in the 12th century, the islands served as an international whaling base during the 17th and 18th centuries. Norway's sovereignty was recognized in 1920; five years later it officially took over the territory.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/1312074.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1312114.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1287640.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1237484.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/371445.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/200274.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/280525.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/578910.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [18.06, 59.33] },
    "properties": {
      "capital": "Stockholm",
      "country": "Sweden",
      "continent": "europe"
    },
    "history":
      "A military power during the 17th century, Sweden has not participated in any war for almost two centuries. An armed neutrality was preserved in both world wars. Sweden's long-successful economic formula of a capitalist system interlarded with substantial welfare elements was challenged in the 1990s by high unemployment and in 2000-02 and 2009 by the global economic downturns, but fiscal discipline over the past several years has allowed the country to weather economic vagaries. Sweden joined the EU in 1995, but the public rejected the introduction of the euro in a 2003 referendum.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/58671.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/975480.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/975468.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/33272.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2910932.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3462442.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/33319.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3801158.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [7.45, 46.95] },
    "properties": {
      "capital": "Berne",
      "country": "Switzerland",
      "continent": "europe"
    },
    "history":
      "The Swiss Confederation was founded in 1291 as a defensive alliance among three cantons. In succeeding years, other localities joined the original three. The Swiss Confederation secured its independence from the Holy Roman Empire in 1499. A constitution of 1848, subsequently modified in 1874, replaced the confederation with a centralized federal government. Switzerland's sovereignty and neutrality have long been honored by the major European powers, and the country was not involved in either of the two world wars. The political and economic integration of Europe over the past half century, as well as Switzerland''s role in many UN and international organizations, has strengthened Switzerland''s ties with its neighbors. However, the country did not officially become a UN member until 2002. Switzerland remains active in many UN and international organizations but retains a strong commitment to neutrality.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/153528.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/84605.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/597976.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/66477.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/307219.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/598067.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/13564.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/13563.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [30.52, 50.45] },
    "properties": {
      "capital": "Kiev",
      "country": "Ukraine",
      "continent": "europe"
    },
    "history":
      "Ukraine was the center of the first eastern Slavic state, Kyivan Rus, which during the 10th and 11th centuries was the largest and most powerful state in Europe. Weakened by internecine quarrels and Mongol invasions, Kyivan Rus was incorporated into the Grand Duchy of Lithuania and eventually into the Polish-Lithuanian Commonwealth. The cultural and religious legacy of Kyivan Rus laid the foundation for Ukrainian nationalism through subsequent centuries. A new Ukrainian state, the Cossack Hetmanate, was established during the mid-17th century after an uprising against the Poles. Despite continuous Muscovite pressure, the Hetmanate managed to remain autonomous for well over 100 years. During the latter part of the 18th century, most Ukrainian ethnographic territory was absorbed by the Russian Empire. Following the collapse of czarist Russia in 1917, Ukraine was able to achieve a short-lived period of independence (1917-20), but was reconquered and forced to endure a brutal Soviet rule that engineered two forced famines (1921-22 and 1932-33) in which over 8 million died. In World War II, German and Soviet armies were responsible for some 7 to 8 million more deaths. Although final independence for Ukraine was achieved in 1991 with the dissolution of the USSR, democracy and prosperity remained elusive as the legacy of state control and endemic corruption stalled efforts at economic reform, privatization, and civil liberties. A peaceful mass protest \"Orange Revolution\" in the closing months of 2004 forced the authorities to overturn a rigged presidential election and to allow a new internationally monitored vote that swept into power a reformist slate under Viktor YUSHCHENKO. Subsequent internal squabbles in the YUSHCHENKO camp allowed his rival Viktor YANUKOVYCH to stage a comeback in parliamentary elections and become prime minister in August of 2006. An early legislative election, brought on by a political crisis in the spring of 2007, saw Yuliya TYMOSHENKO, as head of an \"Orange\" coalition, installed as a new prime minister in December 2007. Viktor YANUKOVUYCH was elected president in a February 2010 run-off election that observers assessed as meeting most international standards. The following month, Ukraine's parliament, the Rada, approved a vote of no-confidence prompting Yuliya TYMOSHENKO to resign from her post as prime minister. In October 2012, Ukraine held Rada elections, widely criticized by Western observers as flawed due to use of government resources to favor ruling party candidates, interference with media access, and harassment of opposition candidates.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/15637631.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/11998857.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/10019994.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/9728135.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1883338.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/11661509.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/146713.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2657803.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [-0.13, 51.51] },
    "properties": {
      "capital": "London",
      "country": "United Kingdom",
      "continent": "europe"
    },
    "history":
      "The United Kingdom has historically played a leading role in developing parliamentary democracy and in advancing literature and science. At its zenith in the 19th century, the British Empire stretched over one-fourth of the earth's surface. The first half of the 20th century saw the UK''s strength seriously depleted in two world wars and the Irish Republic''s withdrawal from the union. The second half witnessed the dismantling of the Empire and the UK rebuilding itself into a modern and prosperous European nation. As one of five permanent members of the UN Security Council and a founding member of NATO and the Commonwealth, the UK pursues a global approach to foreign policy. The UK is also an active member of the EU, although it chose to remain outside the Economic and Monetary Union. The Scottish Parliament, the National Assembly for Wales, and the Northern Ireland Assembly were established in 1999. The latter was suspended until May 2007 due to wrangling over the peace process, but devolution was fully completed in March 2010.",
    "images": [
      "https://mw2.google.com/mw-panoramio/photos/medium/1406828.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/3940513.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2393595.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/578630.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/556025.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/1990084.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2065885.jpg",
      "https://mw2.google.com/mw-panoramio/photos/medium/2220799.jpg"
    ]
  },
  {
    "type": "Feature",
    "geometry": { "type": "Point", "coordinates": [12.45, 41.9] },
    "properties": {
      "capital": "Vatican",
      "country": "Vatican",
      "continent": "europe"
    },
    "history":
      "Popes in their secular role ruled portions of the Italian peninsula for more than a thousand years until the mid 19th century, when many of the Papal States were seized by the newly united Kingdom of Italy. In 1870, the pope's holdings were further circumscribed when Rome itself was annexed. Disputes between a series of \"prisoner\" popes and Italy were resolved in 1929 by three Lateran Treaties, which established the independent state of Vatican City and granted Roman Catholicism special status in Italy. In 1984, a concordat between the Holy See and Italy modified certain of the earlier treaty provisions, including the primacy of Roman Catholicism as the Italian state religion. Present concerns of the Holy See include religious freedom, threats against minority Christian communities in Africa and the Middle East, international development, interreligious dialogue and reconciliation, and the application of church doctrine in an era of rapid change and globalization. About 1.2 billion people worldwide profess the Catholic faith.",
    "images": []
  }
]
